package com.tedu.cn;

/**
 * @phone:13595672347
 * @qq:1441826270
 * @作者：雷玉荣
 * @company: 贵州达内科技有限公司
 * @program 程序 = 数据结构 + 算法 (构成元素 + 运行机理)
 * @comment 达内教育专注于做技术人的指路明灯，
 * 职场生涯的精神导师
 * @date 2019/9/4 0004 11:50
 */
public class Demo4 {

    public static void main(String[] args) {
        /**
         * 基本数据类型之间的转换满足：
         * 小类型转化为大类型系统自动转
         * 大类型转化为小类型需要强转
         *
         * 注意：强转会出现精度损失
         */
        long aa=10;  //小类型转化为大类型，系统自动转
        byte b=10;
        int  c=2;
        b=(byte)c;

        //  作业命名：
       // 专业-学号-姓名-第xx次作业
        /**
         * 通通交给学习委员
         * 学习委员通通将所有的作业
         * 打包（格式为：院校名称-所在学院-班级-科目）.zip
         */
    }
}
